ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/evsys.h
/*
 * Component description for EVSYS
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_EVSYS_COMPONENT_H_
#define _SAMD21_EVSYS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR EVSYS                                        */
/* ************************************************************************** */

/* -------- EVSYS_CTRL : (EVSYS Offset: 0x00) ( /W 8) Control -------- */
#define EVSYS_CTRL_RESETVALUE _UINT8_(0x00) /*  (EVSYS_CTRL) Control  Reset Value */

#define EVSYS_CTRL_SWRST_Pos _UINT8_(0) /* (EVSYS_CTRL) Software Reset Position */
#define EVSYS_CTRL_SWRST_Msk (_UINT8_(0x1) << EVSYS_CTRL_SWRST_Pos) /* (EVSYS_CTRL) Software Reset Mask */
#define EVSYS_CTRL_SWRST(value)                                                                                        \
        (EVSYS_CTRL_SWRST_Msk &                                                                                        \
         (_UINT8_(value) << EVSYS_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the EVSYS_CTRL register */
#define EVSYS_CTRL_GCLKREQ_Pos _UINT8_(4) /* (EVSYS_CTRL) Generic Clock Requests Position */
#define EVSYS_CTRL_GCLKREQ_Msk (_UINT8_(0x1) << EVSYS_CTRL_GCLKREQ_Pos) /* (EVSYS_CTRL) Generic Clock Requests Mask */
#define EVSYS_CTRL_GCLKREQ(value)                                                                                      \
        (EVSYS_CTRL_GCLKREQ_Msk &                                                                                      \
         (_UINT8_(value) << EVSYS_CTRL_GCLKREQ_Pos)) /* Assigment of value for GCLKREQ in the EVSYS_CTRL register */
#define EVSYS_CTRL_Msk _UINT8_(0x11) /* (EVSYS_CTRL) Register Mask  */


/* -------- EVSYS_CHANNEL : (EVSYS Offset: 0x04) (R/W 32) Channel -------- */
#define EVSYS_CHANNEL_RESETVALUE _UINT32_(0x00) /*  (EVSYS_CHANNEL) Channel  Reset Value */

#define EVSYS_CHANNEL_CHANNEL_Pos _UINT32_(0) /* (EVSYS_CHANNEL) Channel Selection Position */
#define EVSYS_CHANNEL_CHANNEL_Msk                                                                                      \
        (_UINT32_(0xF) << EVSYS_CHANNEL_CHANNEL_Pos) /* (EVSYS_CHANNEL) Channel Selection Mask */
#define EVSYS_CHANNEL_CHANNEL(value)                                                                                   \
        (EVSYS_CHANNEL_CHANNEL_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHANNEL_CHANNEL_Pos)) /* Assigment of value for CHANNEL in the EVSYS_CHANNEL register */
#define EVSYS_CHANNEL_SWEVT_Pos _UINT32_(8) /* (EVSYS_CHANNEL) Software Event Position */
#define EVSYS_CHANNEL_SWEVT_Msk (_UINT32_(0x1) << EVSYS_CHANNEL_SWEVT_Pos) /* (EVSYS_CHANNEL) Software Event Mask */
#define EVSYS_CHANNEL_SWEVT(value)                                                                                     \
        (EVSYS_CHANNEL_SWEVT_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHANNEL_SWEVT_Pos)) /* Assigment of value for SWEVT in the EVSYS_CHANNEL register */
#define EVSYS_CHANNEL_EVGEN_Pos _UINT32_(16) /* (EVSYS_CHANNEL) Event Generator Selection Position */
#define EVSYS_CHANNEL_EVGEN_Msk                                                                                        \
        (_UINT32_(0x7F) << EVSYS_CHANNEL_EVGEN_Pos) /* (EVSYS_CHANNEL) Event Generator Selection Mask */
#define EVSYS_CHANNEL_EVGEN(value)                                                                                     \
        (EVSYS_CHANNEL_EVGEN_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHANNEL_EVGEN_Pos)) /* Assigment of value for EVGEN in the EVSYS_CHANNEL register */
#define EVSYS_CHANNEL_PATH_Pos _UINT32_(24) /* (EVSYS_CHANNEL) Path Selection Position */
#define EVSYS_CHANNEL_PATH_Msk (_UINT32_(0x3) << EVSYS_CHANNEL_PATH_Pos) /* (EVSYS_CHANNEL) Path Selection Mask */
#define EVSYS_CHANNEL_PATH(value)                                                                                      \
        (EVSYS_CHANNEL_PATH_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_CHANNEL_PATH_Pos)) /* Assigment of value for PATH in the EVSYS_CHANNEL register */
#define EVSYS_CHANNEL_PATH_SYNCHRONOUS_Val _UINT32_(0x0) /* (EVSYS_CHANNEL) Synchronous path  */
#define EVSYS_CHANNEL_PATH_RESYNCHRONIZED_Val _UINT32_(0x1) /* (EVSYS_CHANNEL) Resynchronized path  */
#define EVSYS_CHANNEL_PATH_ASYNCHRONOUS_Val _UINT32_(0x2) /* (EVSYS_CHANNEL) Asynchronous path  */
#define EVSYS_CHANNEL_PATH_SYNCHRONOUS                                                                                 \
        (EVSYS_CHANNEL_PATH_SYNCHRONOUS_Val << EVSYS_CHANNEL_PATH_Pos) /* (EVSYS_CHANNEL) Synchronous path Position */
#define EVSYS_CHANNEL_PATH_RESYNCHRONIZED                                                                              \
        (EVSYS_CHANNEL_PATH_RESYNCHRONIZED_Val                                                                         \
         << EVSYS_CHANNEL_PATH_Pos) /* (EVSYS_CHANNEL) Resynchronized path Position  */
#define EVSYS_CHANNEL_PATH_ASYNCHRONOUS                                                                                \
        (EVSYS_CHANNEL_PATH_ASYNCHRONOUS_Val                                                                           \
         << EVSYS_CHANNEL_PATH_Pos) /* (EVSYS_CHANNEL) Asynchronous path Position  */
#define EVSYS_CHANNEL_EDGSEL_Pos _UINT32_(26) /* (EVSYS_CHANNEL) Edge Detection Selection Position */
#define EVSYS_CHANNEL_EDGSEL_Msk                                                                                       \
        (_UINT32_(0x3) << EVSYS_CHANNEL_EDGSEL_Pos) /* (EVSYS_CHANNEL) Edge Detection Selection Mask */
#define EVSYS_CHANNEL_EDGSEL(value)                                                                                    \
        (EVSYS_CHANNEL_EDGSEL_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHANNEL_EDGSEL_Pos)) /* Assigment of value for EDGSEL in the EVSYS_CHANNEL register */
#define EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT_Val                                                                         \
        _UINT32_(0x0) /* (EVSYS_CHANNEL) No event output when using the resynchronized or synchronous path  */
#define EVSYS_CHANNEL_EDGSEL_RISING_EDGE_Val                                                                           \
        _UINT32_(0x1) /* (EVSYS_CHANNEL) Event detection only on the rising edge of the signal from the event          \
                         generator when using the resynchronized or synchronous path  */
#define EVSYS_CHANNEL_EDGSEL_FALLING_EDGE_Val                                                                          \
        _UINT32_(0x2) /* (EVSYS_CHANNEL) Event detection only on the falling edge of the signal from the event         \
                         generator when using the resynchronized or synchronous path  */
#define EVSYS_CHANNEL_EDGSEL_BOTH_EDGES_Val                                                                            \
        _UINT32_(0x3) /* (EVSYS_CHANNEL) Event detection on rising and falling edges of the signal from the event      \
                         generator when using the resynchronized or synchronous path  */
#define EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT                                                                             \
        (EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT_Val                                                                        \
         << EVSYS_CHANNEL_EDGSEL_Pos) /* (EVSYS_CHANNEL) No event output when using the resynchronized or synchronous  \
                                         path Position  */
#define EVSYS_CHANNEL_EDGSEL_RISING_EDGE                                                                               \
        (EVSYS_CHANNEL_EDGSEL_RISING_EDGE_Val                                                                          \
         << EVSYS_CHANNEL_EDGSEL_Pos) /* (EVSYS_CHANNEL) Event detection only on the rising edge of the signal from    \
                                         the event generator when using the resynchronized or synchronous path         \
                                         Position  */
#define EVSYS_CHANNEL_EDGSEL_FALLING_EDGE                                                                              \
        (EVSYS_CHANNEL_EDGSEL_FALLING_EDGE_Val                                                                         \
         << EVSYS_CHANNEL_EDGSEL_Pos) /* (EVSYS_CHANNEL) Event detection only on the falling edge of the signal from   \
                                         the event generator when using the resynchronized or synchronous path         \
                                         Position  */
#define EVSYS_CHANNEL_EDGSEL_BOTH_EDGES                                                                                \
        (EVSYS_CHANNEL_EDGSEL_BOTH_EDGES_Val                                                                           \
         << EVSYS_CHANNEL_EDGSEL_Pos) /* (EVSYS_CHANNEL) Event detection on rising and falling edges of the signal     \
                                         from the event generator when using the resynchronized or synchronous path    \
                                         Position  */
#define EVSYS_CHANNEL_Msk _UINT32_(0x0F7F010F) /* (EVSYS_CHANNEL) Register Mask  */


/* -------- EVSYS_USER : (EVSYS Offset: 0x08) (R/W 16) User Multiplexer -------- */
#define EVSYS_USER_RESETVALUE _UINT16_(0x00) /*  (EVSYS_USER) User Multiplexer  Reset Value */

#define EVSYS_USER_USER_Pos _UINT16_(0) /* (EVSYS_USER) User Multiplexer Selection Position */
#define EVSYS_USER_USER_Msk (_UINT16_(0x1F) << EVSYS_USER_USER_Pos) /* (EVSYS_USER) User Multiplexer Selection Mask */
#define EVSYS_USER_USER(value)                                                                                         \
        (EVSYS_USER_USER_Msk &                                                                                         \
         (_UINT16_(value) << EVSYS_USER_USER_Pos)) /* Assigment of value for USER in the EVSYS_USER register */
#define EVSYS_USER_CHANNEL_Pos _UINT16_(8) /* (EVSYS_USER) Channel Event Selection Position */
#define EVSYS_USER_CHANNEL_Msk                                                                                         \
        (_UINT16_(0x1F) << EVSYS_USER_CHANNEL_Pos) /* (EVSYS_USER) Channel Event Selection Mask */
#define EVSYS_USER_CHANNEL(value)                                                                                      \
        (EVSYS_USER_CHANNEL_Msk &                                                                                      \
         (_UINT16_(value) << EVSYS_USER_CHANNEL_Pos)) /* Assigment of value for CHANNEL in the EVSYS_USER register */
#define EVSYS_USER_CHANNEL_0_Val _UINT16_(0x0) /* (EVSYS_USER) No Channel Output Selected  */
#define EVSYS_USER_CHANNEL_0                                                                                           \
        (EVSYS_USER_CHANNEL_0_Val << EVSYS_USER_CHANNEL_Pos) /* (EVSYS_USER) No Channel Output Selected Position  */
#define EVSYS_USER_Msk _UINT16_(0x1F1F) /* (EVSYS_USER) Register Mask  */


