ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/evsys.h
/* -------- EVSYS_CHSTATUS : (EVSYS Offset: 0x0C) ( R/ 32) Channel Status -------- */
#define EVSYS_CHSTATUS_RESETVALUE _UINT32_(0xF00FF) /*  (EVSYS_CHSTATUS) Channel Status  Reset Value */

#define EVSYS_CHSTATUS_USRRDY0_Pos _UINT32_(0) /* (EVSYS_CHSTATUS) Channel 0 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY0_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY0_Pos) /* (EVSYS_CHSTATUS) Channel 0 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY0(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY0_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY0_Pos)) /* Assigment of value for USRRDY0 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY1_Pos _UINT32_(1) /* (EVSYS_CHSTATUS) Channel 1 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY1_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY1_Pos) /* (EVSYS_CHSTATUS) Channel 1 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY1(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY1_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY1_Pos)) /* Assigment of value for USRRDY1 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY2_Pos _UINT32_(2) /* (EVSYS_CHSTATUS) Channel 2 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY2_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY2_Pos) /* (EVSYS_CHSTATUS) Channel 2 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY2(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY2_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY2_Pos)) /* Assigment of value for USRRDY2 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY3_Pos _UINT32_(3) /* (EVSYS_CHSTATUS) Channel 3 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY3_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY3_Pos) /* (EVSYS_CHSTATUS) Channel 3 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY3(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY3_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY3_Pos)) /* Assigment of value for USRRDY3 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY4_Pos _UINT32_(4) /* (EVSYS_CHSTATUS) Channel 4 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY4_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY4_Pos) /* (EVSYS_CHSTATUS) Channel 4 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY4(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY4_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY4_Pos)) /* Assigment of value for USRRDY4 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY5_Pos _UINT32_(5) /* (EVSYS_CHSTATUS) Channel 5 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY5_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY5_Pos) /* (EVSYS_CHSTATUS) Channel 5 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY5(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY5_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY5_Pos)) /* Assigment of value for USRRDY5 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY6_Pos _UINT32_(6) /* (EVSYS_CHSTATUS) Channel 6 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY6_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY6_Pos) /* (EVSYS_CHSTATUS) Channel 6 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY6(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY6_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY6_Pos)) /* Assigment of value for USRRDY6 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY7_Pos _UINT32_(7) /* (EVSYS_CHSTATUS) Channel 7 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY7_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY7_Pos) /* (EVSYS_CHSTATUS) Channel 7 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY7(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY7_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY7_Pos)) /* Assigment of value for USRRDY7 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY0_Pos _UINT32_(8) /* (EVSYS_CHSTATUS) Channel 0 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY0_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY0_Pos) /* (EVSYS_CHSTATUS) Channel 0 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY0(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY0_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY0_Pos)) /* Assigment of value for CHBUSY0 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY1_Pos _UINT32_(9) /* (EVSYS_CHSTATUS) Channel 1 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY1_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY1_Pos) /* (EVSYS_CHSTATUS) Channel 1 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY1(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY1_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY1_Pos)) /* Assigment of value for CHBUSY1 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY2_Pos _UINT32_(10) /* (EVSYS_CHSTATUS) Channel 2 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY2_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY2_Pos) /* (EVSYS_CHSTATUS) Channel 2 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY2(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY2_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY2_Pos)) /* Assigment of value for CHBUSY2 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY3_Pos _UINT32_(11) /* (EVSYS_CHSTATUS) Channel 3 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY3_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY3_Pos) /* (EVSYS_CHSTATUS) Channel 3 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY3(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY3_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY3_Pos)) /* Assigment of value for CHBUSY3 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY4_Pos _UINT32_(12) /* (EVSYS_CHSTATUS) Channel 4 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY4_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY4_Pos) /* (EVSYS_CHSTATUS) Channel 4 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY4(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY4_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY4_Pos)) /* Assigment of value for CHBUSY4 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY5_Pos _UINT32_(13) /* (EVSYS_CHSTATUS) Channel 5 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY5_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY5_Pos) /* (EVSYS_CHSTATUS) Channel 5 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY5(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY5_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY5_Pos)) /* Assigment of value for CHBUSY5 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY6_Pos _UINT32_(14) /* (EVSYS_CHSTATUS) Channel 6 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY6_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY6_Pos) /* (EVSYS_CHSTATUS) Channel 6 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY6(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY6_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY6_Pos)) /* Assigment of value for CHBUSY6 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY7_Pos _UINT32_(15) /* (EVSYS_CHSTATUS) Channel 7 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY7_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY7_Pos) /* (EVSYS_CHSTATUS) Channel 7 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY7(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY7_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY7_Pos)) /* Assigment of value for CHBUSY7 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY8_Pos _UINT32_(16) /* (EVSYS_CHSTATUS) Channel 8 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY8_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY8_Pos) /* (EVSYS_CHSTATUS) Channel 8 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY8(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY8_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY8_Pos)) /* Assigment of value for USRRDY8 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY9_Pos _UINT32_(17) /* (EVSYS_CHSTATUS) Channel 9 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY9_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY9_Pos) /* (EVSYS_CHSTATUS) Channel 9 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY9(value)                                                                                  \
        (EVSYS_CHSTATUS_USRRDY9_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY9_Pos)) /* Assigment of value for USRRDY9 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY10_Pos _UINT32_(18) /* (EVSYS_CHSTATUS) Channel 10 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY10_Msk                                                                                    \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY10_Pos) /* (EVSYS_CHSTATUS) Channel 10 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY10(value)                                                                                 \
        (EVSYS_CHSTATUS_USRRDY10_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY10_Pos)) /* Assigment of value for USRRDY10 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_USRRDY11_Pos _UINT32_(19) /* (EVSYS_CHSTATUS) Channel 11 User Ready Position */
#define EVSYS_CHSTATUS_USRRDY11_Msk                                                                                    \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_USRRDY11_Pos) /* (EVSYS_CHSTATUS) Channel 11 User Ready Mask */
#define EVSYS_CHSTATUS_USRRDY11(value)                                                                                 \
        (EVSYS_CHSTATUS_USRRDY11_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_USRRDY11_Pos)) /* Assigment of value for USRRDY11 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY8_Pos _UINT32_(24) /* (EVSYS_CHSTATUS) Channel 8 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY8_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY8_Pos) /* (EVSYS_CHSTATUS) Channel 8 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY8(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY8_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY8_Pos)) /* Assigment of value for CHBUSY8 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY9_Pos _UINT32_(25) /* (EVSYS_CHSTATUS) Channel 9 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY9_Msk                                                                                     \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY9_Pos) /* (EVSYS_CHSTATUS) Channel 9 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY9(value)                                                                                  \
        (EVSYS_CHSTATUS_CHBUSY9_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY9_Pos)) /* Assigment of value for CHBUSY9 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY10_Pos _UINT32_(26) /* (EVSYS_CHSTATUS) Channel 10 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY10_Msk                                                                                    \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY10_Pos) /* (EVSYS_CHSTATUS) Channel 10 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY10(value)                                                                                 \
        (EVSYS_CHSTATUS_CHBUSY10_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY10_Pos)) /* Assigment of value for CHBUSY10 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_CHBUSY11_Pos _UINT32_(27) /* (EVSYS_CHSTATUS) Channel 11 Busy Position */
#define EVSYS_CHSTATUS_CHBUSY11_Msk                                                                                    \
        (_UINT32_(0x1) << EVSYS_CHSTATUS_CHBUSY11_Pos) /* (EVSYS_CHSTATUS) Channel 11 Busy Mask */
#define EVSYS_CHSTATUS_CHBUSY11(value)                                                                                 \
        (EVSYS_CHSTATUS_CHBUSY11_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << EVSYS_CHSTATUS_CHBUSY11_Pos)) /* Assigment of value for CHBUSY11 in the EVSYS_CHSTATUS register */
#define EVSYS_CHSTATUS_Msk _UINT32_(0x0F0FFFFF) /* (EVSYS_CHSTATUS) Register Mask  */


/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x10) (R/W 32) Interrupt Enable Clear -------- */
#define EVSYS_INTENCLR_RESETVALUE _UINT32_(0x00) /*  (EVSYS_INTENCLR) Interrupt Enable Clear  Reset Value */

