ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/evsys.h
#define EVSYS_INTFLAG_OVR0_Pos _UINT32_(0) /* (EVSYS_INTFLAG) Channel 0 Overrun Position */
#define EVSYS_INTFLAG_OVR0_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR0_Pos) /* (EVSYS_INTFLAG) Channel 0 Overrun Mask */
#define EVSYS_INTFLAG_OVR0(value)                                                                                      \
        (EVSYS_INTFLAG_OVR0_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR0_Pos)) /* Assigment of value for OVR0 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR1_Pos _UINT32_(1) /* (EVSYS_INTFLAG) Channel 1 Overrun Position */
#define EVSYS_INTFLAG_OVR1_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR1_Pos) /* (EVSYS_INTFLAG) Channel 1 Overrun Mask */
#define EVSYS_INTFLAG_OVR1(value)                                                                                      \
        (EVSYS_INTFLAG_OVR1_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR1_Pos)) /* Assigment of value for OVR1 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR2_Pos _UINT32_(2) /* (EVSYS_INTFLAG) Channel 2 Overrun Position */
#define EVSYS_INTFLAG_OVR2_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR2_Pos) /* (EVSYS_INTFLAG) Channel 2 Overrun Mask */
#define EVSYS_INTFLAG_OVR2(value)                                                                                      \
        (EVSYS_INTFLAG_OVR2_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR2_Pos)) /* Assigment of value for OVR2 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR3_Pos _UINT32_(3) /* (EVSYS_INTFLAG) Channel 3 Overrun Position */
#define EVSYS_INTFLAG_OVR3_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR3_Pos) /* (EVSYS_INTFLAG) Channel 3 Overrun Mask */
#define EVSYS_INTFLAG_OVR3(value)                                                                                      \
        (EVSYS_INTFLAG_OVR3_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR3_Pos)) /* Assigment of value for OVR3 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR4_Pos _UINT32_(4) /* (EVSYS_INTFLAG) Channel 4 Overrun Position */
#define EVSYS_INTFLAG_OVR4_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR4_Pos) /* (EVSYS_INTFLAG) Channel 4 Overrun Mask */
#define EVSYS_INTFLAG_OVR4(value)                                                                                      \
        (EVSYS_INTFLAG_OVR4_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR4_Pos)) /* Assigment of value for OVR4 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR5_Pos _UINT32_(5) /* (EVSYS_INTFLAG) Channel 5 Overrun Position */
#define EVSYS_INTFLAG_OVR5_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR5_Pos) /* (EVSYS_INTFLAG) Channel 5 Overrun Mask */
#define EVSYS_INTFLAG_OVR5(value)                                                                                      \
        (EVSYS_INTFLAG_OVR5_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR5_Pos)) /* Assigment of value for OVR5 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR6_Pos _UINT32_(6) /* (EVSYS_INTFLAG) Channel 6 Overrun Position */
#define EVSYS_INTFLAG_OVR6_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR6_Pos) /* (EVSYS_INTFLAG) Channel 6 Overrun Mask */
#define EVSYS_INTFLAG_OVR6(value)                                                                                      \
        (EVSYS_INTFLAG_OVR6_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR6_Pos)) /* Assigment of value for OVR6 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR7_Pos _UINT32_(7) /* (EVSYS_INTFLAG) Channel 7 Overrun Position */
#define EVSYS_INTFLAG_OVR7_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR7_Pos) /* (EVSYS_INTFLAG) Channel 7 Overrun Mask */
#define EVSYS_INTFLAG_OVR7(value)                                                                                      \
        (EVSYS_INTFLAG_OVR7_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR7_Pos)) /* Assigment of value for OVR7 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD0_Pos _UINT32_(8) /* (EVSYS_INTFLAG) Channel 0 Event Detection Position */
#define EVSYS_INTFLAG_EVD0_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD0_Pos) /* (EVSYS_INTFLAG) Channel 0 Event Detection Mask */
#define EVSYS_INTFLAG_EVD0(value)                                                                                      \
        (EVSYS_INTFLAG_EVD0_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD0_Pos)) /* Assigment of value for EVD0 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD1_Pos _UINT32_(9) /* (EVSYS_INTFLAG) Channel 1 Event Detection Position */
#define EVSYS_INTFLAG_EVD1_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD1_Pos) /* (EVSYS_INTFLAG) Channel 1 Event Detection Mask */
#define EVSYS_INTFLAG_EVD1(value)                                                                                      \
        (EVSYS_INTFLAG_EVD1_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD1_Pos)) /* Assigment of value for EVD1 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD2_Pos _UINT32_(10) /* (EVSYS_INTFLAG) Channel 2 Event Detection Position */
#define EVSYS_INTFLAG_EVD2_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD2_Pos) /* (EVSYS_INTFLAG) Channel 2 Event Detection Mask */
#define EVSYS_INTFLAG_EVD2(value)                                                                                      \
        (EVSYS_INTFLAG_EVD2_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD2_Pos)) /* Assigment of value for EVD2 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD3_Pos _UINT32_(11) /* (EVSYS_INTFLAG) Channel 3 Event Detection Position */
#define EVSYS_INTFLAG_EVD3_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD3_Pos) /* (EVSYS_INTFLAG) Channel 3 Event Detection Mask */
#define EVSYS_INTFLAG_EVD3(value)                                                                                      \
        (EVSYS_INTFLAG_EVD3_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD3_Pos)) /* Assigment of value for EVD3 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD4_Pos _UINT32_(12) /* (EVSYS_INTFLAG) Channel 4 Event Detection Position */
#define EVSYS_INTFLAG_EVD4_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD4_Pos) /* (EVSYS_INTFLAG) Channel 4 Event Detection Mask */
#define EVSYS_INTFLAG_EVD4(value)                                                                                      \
        (EVSYS_INTFLAG_EVD4_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD4_Pos)) /* Assigment of value for EVD4 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD5_Pos _UINT32_(13) /* (EVSYS_INTFLAG) Channel 5 Event Detection Position */
#define EVSYS_INTFLAG_EVD5_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD5_Pos) /* (EVSYS_INTFLAG) Channel 5 Event Detection Mask */
#define EVSYS_INTFLAG_EVD5(value)                                                                                      \
        (EVSYS_INTFLAG_EVD5_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD5_Pos)) /* Assigment of value for EVD5 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD6_Pos _UINT32_(14) /* (EVSYS_INTFLAG) Channel 6 Event Detection Position */
#define EVSYS_INTFLAG_EVD6_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD6_Pos) /* (EVSYS_INTFLAG) Channel 6 Event Detection Mask */
#define EVSYS_INTFLAG_EVD6(value)                                                                                      \
        (EVSYS_INTFLAG_EVD6_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD6_Pos)) /* Assigment of value for EVD6 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD7_Pos _UINT32_(15) /* (EVSYS_INTFLAG) Channel 7 Event Detection Position */
#define EVSYS_INTFLAG_EVD7_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD7_Pos) /* (EVSYS_INTFLAG) Channel 7 Event Detection Mask */
#define EVSYS_INTFLAG_EVD7(value)                                                                                      \
        (EVSYS_INTFLAG_EVD7_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD7_Pos)) /* Assigment of value for EVD7 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR8_Pos _UINT32_(16) /* (EVSYS_INTFLAG) Channel 8 Overrun Position */
#define EVSYS_INTFLAG_OVR8_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR8_Pos) /* (EVSYS_INTFLAG) Channel 8 Overrun Mask */
#define EVSYS_INTFLAG_OVR8(value)                                                                                      \
        (EVSYS_INTFLAG_OVR8_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR8_Pos)) /* Assigment of value for OVR8 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR9_Pos _UINT32_(17) /* (EVSYS_INTFLAG) Channel 9 Overrun Position */
#define EVSYS_INTFLAG_OVR9_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR9_Pos) /* (EVSYS_INTFLAG) Channel 9 Overrun Mask */
#define EVSYS_INTFLAG_OVR9(value)                                                                                      \
        (EVSYS_INTFLAG_OVR9_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_OVR9_Pos)) /* Assigment of value for OVR9 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR10_Pos _UINT32_(18) /* (EVSYS_INTFLAG) Channel 10 Overrun Position */
#define EVSYS_INTFLAG_OVR10_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR10_Pos) /* (EVSYS_INTFLAG) Channel 10 Overrun Mask  \
                                                                            */
#define EVSYS_INTFLAG_OVR10(value)                                                                                     \
        (EVSYS_INTFLAG_OVR10_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_INTFLAG_OVR10_Pos)) /* Assigment of value for OVR10 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_OVR11_Pos _UINT32_(19) /* (EVSYS_INTFLAG) Channel 11 Overrun Position */
#define EVSYS_INTFLAG_OVR11_Msk (_UINT32_(0x1) << EVSYS_INTFLAG_OVR11_Pos) /* (EVSYS_INTFLAG) Channel 11 Overrun Mask  \
                                                                            */
#define EVSYS_INTFLAG_OVR11(value)                                                                                     \
        (EVSYS_INTFLAG_OVR11_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_INTFLAG_OVR11_Pos)) /* Assigment of value for OVR11 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD8_Pos _UINT32_(24) /* (EVSYS_INTFLAG) Channel 8 Event Detection Position */
#define EVSYS_INTFLAG_EVD8_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD8_Pos) /* (EVSYS_INTFLAG) Channel 8 Event Detection Mask */
#define EVSYS_INTFLAG_EVD8(value)                                                                                      \
        (EVSYS_INTFLAG_EVD8_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD8_Pos)) /* Assigment of value for EVD8 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD9_Pos _UINT32_(25) /* (EVSYS_INTFLAG) Channel 9 Event Detection Position */
#define EVSYS_INTFLAG_EVD9_Msk                                                                                         \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD9_Pos) /* (EVSYS_INTFLAG) Channel 9 Event Detection Mask */
#define EVSYS_INTFLAG_EVD9(value)                                                                                      \
        (EVSYS_INTFLAG_EVD9_Msk &                                                                                      \
         (_UINT32_(value) << EVSYS_INTFLAG_EVD9_Pos)) /* Assigment of value for EVD9 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD10_Pos _UINT32_(26) /* (EVSYS_INTFLAG) Channel 10 Event Detection Position */
#define EVSYS_INTFLAG_EVD10_Msk                                                                                        \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD10_Pos) /* (EVSYS_INTFLAG) Channel 10 Event Detection Mask */
#define EVSYS_INTFLAG_EVD10(value)                                                                                     \
        (EVSYS_INTFLAG_EVD10_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_INTFLAG_EVD10_Pos)) /* Assigment of value for EVD10 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_EVD11_Pos _UINT32_(27) /* (EVSYS_INTFLAG) Channel 11 Event Detection Position */
#define EVSYS_INTFLAG_EVD11_Msk                                                                                        \
        (_UINT32_(0x1) << EVSYS_INTFLAG_EVD11_Pos) /* (EVSYS_INTFLAG) Channel 11 Event Detection Mask */
#define EVSYS_INTFLAG_EVD11(value)                                                                                     \
        (EVSYS_INTFLAG_EVD11_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EVSYS_INTFLAG_EVD11_Pos)) /* Assigment of value for EVD11 in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_Msk _UINT32_(0x0F0FFFFF) /* (EVSYS_INTFLAG) Register Mask  */


