ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/evsys.h
/** \brief EVSYS register offsets definitions */
#define EVSYS_CTRL_REG_OFST _UINT32_(0x00) /* (EVSYS_CTRL) Control Offset */
#define EVSYS_CHANNEL_REG_OFST _UINT32_(0x04) /* (EVSYS_CHANNEL) Channel Offset */
#define EVSYS_USER_REG_OFST _UINT32_(0x08) /* (EVSYS_USER) User Multiplexer Offset */
#define EVSYS_CHSTATUS_REG_OFST _UINT32_(0x0C) /* (EVSYS_CHSTATUS) Channel Status Offset */
#define EVSYS_INTENCLR_REG_OFST _UINT32_(0x10) /* (EVSYS_INTENCLR) Interrupt Enable Clear Offset */
#define EVSYS_INTENSET_REG_OFST _UINT32_(0x14) /* (EVSYS_INTENSET) Interrupt Enable Set Offset */
#define EVSYS_INTFLAG_REG_OFST _UINT32_(0x18) /* (EVSYS_INTFLAG) Interrupt Flag Status and Clear Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief EVSYS register API structure */
typedef struct { /* Event System Interface */
        __O uint8_t EVSYS_CTRL; /**< Offset: 0x00 ( /W  8) Control */
        __I uint8_t Reserved1[0x03];
        __IO uint32_t EVSYS_CHANNEL; /**< Offset: 0x04 (R/W  32) Channel */
        __IO uint16_t EVSYS_USER; /**< Offset: 0x08 (R/W  16) User Multiplexer */
        __I uint8_t Reserved2[0x02];
        __I uint32_t EVSYS_CHSTATUS; /**< Offset: 0x0C (R/   32) Channel Status */
        __IO uint32_t EVSYS_INTENCLR; /**< Offset: 0x10 (R/W  32) Interrupt Enable Clear */
        __IO uint32_t EVSYS_INTENSET; /**< Offset: 0x14 (R/W  32) Interrupt Enable Set */
        __IO uint32_t EVSYS_INTFLAG; /**< Offset: 0x18 (R/W  32) Interrupt Flag Status and Clear */
} evsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_EVSYS_COMPONENT_H_ */
